In [1]:
import pandas as pd

# DataFrame and Series
> ```DataFrame``` is two dimentions dataset ```[row, column]```, equivalent to ```Dict``` in vanila Python\
> ```Series``` is one dimention dataset, equivalent to ```List``` in vanila python

In [2]:
sr = pd.Series([1,3,5,6])

In [3]:
type(sr)

pandas.core.series.Series

In [4]:
df = pd.DataFrame(data={
    "firstName": ["Nathapon", "John", "Nina"],
    "lastName": ["Boonthongkaew", "Doe", "dee"],
    "age": [25, 25, 21]
})

In [5]:
df

  firstName       lastName  age
0  Nathapon  Boonthongkaew   25
1      John            Doe   25
2      Nina            dee   21

In [6]:
pyDict = {"temp": [1,3,5,7], "humid": [2,4,6,1]}

In [7]:
df1 = pd.DataFrame(data=pyDict)

In [8]:
df1

   temp  humid
0     1      2
1     3      4
2     5      6
3     7      1

## Accessing Data structure
> ```column``` use column name to select specific column

In [9]:
# NOTE: this returns a single column e.i. it returns ```Series``` of data
df["firstName"]

0    Nathapon
1        John
2        Nina
Name: firstName, dtype: object

In [10]:
# NOTE: this returns mutiple columns/dimention e.i. it returns ```DataFrame```
df[['firstName', 'age']]

  firstName  age
0  Nathapon   25
1      John   25
2      Nina   21

> ```row``` could not be accessed like column name X```df[0]```X\
> Instead use ```iloc``` which is stand for *integer location* to locate specific row

### ```iloc```
> ```df.iloc[row index, column index]```

In [11]:
df.iloc[[0, 2], [0,1]]

  firstName       lastName
0  Nathapon  Boonthongkaew
2      Nina            dee

### ```loc```
> ```loc``` is pretty much like ```iloc``` but instead it allows label for locating specific value

In [12]:
df.loc[0:1, 'firstName': 'age']

  firstName       lastName  age
0  Nathapon  Boonthongkaew   25
1      John            Doe   25

## Filtering Data

In [24]:
# insert condition for target result
df[df['age'] > 22]

  firstName       lastName  age
0  Nathapon  Boonthongkaew   25
1      John            Doe   25